Autodesk.Revit.DB.TriangulatedShellComponent.GetTriangle(System.Int32)
Returns the triangle corresponding to the given index.
triangleIndex:
The index of the triangle (between 0 and TriangleCount-1, inclusive).
Returns:
The triangle.
Throws Autodesk.Revit.Exceptions.ArgumentException:
triangleIndex is out of range.
Since:
2013

Autodesk.Revit.DB.TriangulatedShellComponent.Clear
Empties the contents of this TriangulatedShellComponent.
Since:
2013

Autodesk.Revit.DB.TriangulatedShellComponent.GetVertex(System.Int32)
Returns the vertex with a given index.
vertexIndex:
The index of the vertex (between 0 and getVertexCount()-1, inclusive).
Returns:
A copy of the requested vertex.
Throws Autodesk.Revit.Exceptions.ArgumentException:
vertexIndex is out of range.
Since:
2013

Autodesk.Revit.DB.TriangulatedShellComponent.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.DB.TriangulatedShellComponent.TriangleCount
The number of triangles in the triangulation.
Since:
2013

Autodesk.Revit.DB.TriangulatedShellComponent.VertexCount
The number of vertices in the triangulation.
Since:
2013

Autodesk.Revit.DB.TriangulatedShellComponent.IsClosed
True if and only if the triangulation represents a topologically closed shell
(i.e., each edge is shared by two triangles).
Since:
2013

Autodesk.Revit.DB.TriangulatedShellComponent
This class represents a triangulated boundary component of a solid or a
triangulated connected component of a shell.
Remarks:
The triangulation is "topologically connected" in the following sense:
if two triangles share an edge geometrically, then they share a single edge
topologically (i.e., they share two vertices defining the geometrically shared
edge).
Since:
2013